Revit 2026 API

# CADLinkOperations Properties

---

The CADLinkOperations type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LinkOperations) |

#### Reference

CADLinkOperations Class

Autodesk.Revit.DB Namespace